Run arguments: {'features': 200, 'net_depth': 0, 'net_width': 16, 'dropout': 0.5, 'learning_rate': 0.0001, 'batchsize': 64, 'epochs': 600, 'k_folds': 5, 'oversampling_aggressiveness': 1.0, 'conv': 1, 'conv_kernels': '5', 'conv_strides': '2', 'conv_filters': '32', 'conv_activations': 'relu', 'conv_padding': 'same', 'pool_layers': 'A', 'verbose': False}


Model: "guitar_timbre_classifier_20230323-161006"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_0 (Conv2D)              (None, 9, 100, 32)        832       
_________________________________________________________________
batchnorm_0 (BatchNormalizat (None, 9, 100, 32)        128       
_________________________________________________________________
Apool_0 (AveragePooling2D)   (None, 4, 50, 32)         0         
_________________________________________________________________
flatten_0 (Flatten)          (None, 6400)              0         
_________________________________________________________________
dropout_0 (Dropout)          (None, 6400)              0         
_________________________________________________________________
OUT_dense_0 (Dense)          (None, 8)                 51208     
=================================================================
Total params: 52,168
Trainable params: 52,104
Non-trainable params: 64
_________________________________________________________________
