{'features': 'all', 'net_depth': 2, 'net_width': 32, 'dropout': 0.5, 'learning_rate': 8e-05, 'batchsize': 64, 'epochs': 500, 'k_folds': 5, 'oversampling': True, 'oversampling_aggressiveness': 1.0, 'conv': 2, 'conv_kernels': '3,3', 'conv_strides': '1,1', 'conv_filters': '4,4', 'conv_activations': 'relu,relu', 'conv_padding': 'same,same', 'pool_layers': 'M,M', 'verbose': False}


Model: "guitar_timbre_classifier_20230309-100240"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_0 (Conv2D)              (None, 6, 271, 4)         40        
_________________________________________________________________
batchnorm_0 (BatchNormalizat (None, 6, 271, 4)         16        
_________________________________________________________________
Mpool_0 (MaxPooling2D)       (None, 3, 135, 4)         0         
_________________________________________________________________
conv_1 (Conv2D)              (None, 3, 135, 4)         148       
_________________________________________________________________
batchnorm_1 (BatchNormalizat (None, 3, 135, 4)         16        
_________________________________________________________________
Mpool_1 (MaxPooling2D)       (None, 1, 67, 4)          0         
_________________________________________________________________
flatten_0 (Flatten)          (None, 268)               0         
_________________________________________________________________
dropout_0 (Dropout)          (None, 268)               0         
_________________________________________________________________
dense_0 (Dense)              (None, 32)                8608      
_________________________________________________________________
batchnorm_2 (BatchNormalizat (None, 32)                128       
_________________________________________________________________
dropout_1 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                1056      
_________________________________________________________________
batchnorm_3 (BatchNormalizat (None, 32)                128       
_________________________________________________________________
dropout_2 (Dropout)          (None, 32)                0         
_________________________________________________________________
OUT_dense_2 (Dense)          (None, 8)                 264       
=================================================================
Total params: 10,404
Trainable params: 10,260
Non-trainable params: 144
_________________________________________________________________
